app/controllers/api/v1/article/resources/article.rb

SELECT "articles".* FROM "articles"
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "body", "author", "created_at", "updated_at", "blast") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  resource :article do
    desc "All"
    get do
      present Article.all, with: Api::V1::Article::Entities::Article
    end
    desc "Get One"
    get ":id" do
      Article.find(params[:id])
    end
    desc "Create"
    post do
      article = Article.create(params)

SELECT "authors".* FROM "authors" WHERE "authors"."email" = $1 LIMIT $2  [["email", "dirgantoro.developer@gmail.com"], ["LIMIT", 1]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."author_id" = $1  [["author_id", 2]]
SELECT "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "schedulers" ("clock", "sun", "mon", "tue", "wed", "thu", "fri", "sat", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
        }
      )
      pdf.render_file(params[:title] + ".pdf")
      author = Author.find_by_email(params[:author])
      subscriptions = Subscription.where(author_id: author.id)
      subscriptions.each do|subscription|
        subscriber = Subscriber.find(subscription.subscriber_id)
        # ::TesMailer.send_email_subscriber(subscriber, author, article)
        Scheduler.create(clock: "07:40",sun:false,mon:false,tue:false,wed:false,thu:false,fri:true,sat:false)