app/controllers/api/v1/scheduler/resources/scheduler.rb

class Api::V1::Scheduler::Resources::Scheduler < Grape::API
  resource :scheduler do
    get do
      present Scheduler.all, with: Api::V1::Scheduler::Entities::Scheduler
    end
    post do
      Scheduler.create(params)
    end
    put do
      scheduler = Scheduler.find(params[:id])
      scheduler.update(params)
---
SELECT "schedulers".* FROM "schedulers"
INSERT INTO "schedulers" ("clock", "sun", "mon", "tue", "wed", "thu", "fri", "sat", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "schedulers".* FROM "schedulers" WHERE "schedulers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "schedulers" SET "clock" = $1, "updated_at" = $2 WHERE "schedulers"."id" = $3  [["clock", "77:77"], ["updated_at", "2022-05-20 05:55:08.160940"], ["id", 5]]