app/controllers/api/v1/author/resources/author.rb

SELECT "authors".* FROM "authors"
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  resource :author do
    desc "All"
    get do
      present Author.all, with: Api::V1::Author::Entities::Author
    end
    desc "Get One"
    get ":id" do
      Author.find(params[:id])

INSERT INTO "authors" ("name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dirga"], ["email", "dirgantoro.developer@gmail.com"], ["phone", "085646658259"], ["created_at", "2022-05-15 05:55:27.037977"], ["updated_at", "2022-05-15 05:55:27.037977"]]
UPDATE "authors" SET "name" = $1, "updated_at" = $2 WHERE "authors"."id" = $3  [["name", "dirgantoros "], ["updated_at", "2022-05-15 05:46:36.976633"], ["id", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 1]]
---
      use :author_params
    end
    post do
      Author.create(params)
    end
    desc "Update"
    put do
      Author.find(params[:id]).update(params)
    end
    desc "Delete"
    delete do
      Author.find(params[:id]).destroy