app/controllers/api/v1/subscriber/resources/subscriber.rb

SELECT "subscribers".* FROM "subscribers"
SELECT "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  helpers Api::V1::Subscriber::Params::Subscriber
  resource :subscriber do
    get do
      present Subscriber.all, with: Api::V1::Subscriber::Entities::Subscriber
    end
    get ":id" do
      Subscriber.find(params[:id])

INSERT INTO "subscribers" ("name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dirga"], ["email", "dirgantoro.developer@gmail.com"], ["phone", "085646658259"], ["created_at", "2022-05-15 05:57:50.396139"], ["updated_at", "2022-05-15 05:57:50.396139"]]
---
      use :subscriber_params
    end
    post do
      subscriber = Subscriber.create(params)