app/controllers/api/v1/subscription/resources/subscription.rb

    end
    desc "Create"
    post do
      Subscription.create(author_id: params[:author_id],subscriber_id: params[:subscriber_id])
    end
    desc "Delete"
    delete do
      subscription = Subscription.find(params[:id])
      subscription.destroy
---
INSERT INTO "subscriptions" ("created_at", "updated_at", "author_id", "subscriber_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-05-16 07:43:41.575365"], ["updated_at", "2022-05-16 07:43:41.575365"], ["author_id", 2], ["subscriber_id", 3]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "subscriptions" WHERE "subscriptions"."id" = $1  [["id", 2]]